Repository: City-busz/Valuta
Catalog: po/*.po
Languages: ta

source: Convert between currencies
ta: நாணயங்களுக்கு இடையில் மாற்றவும்

source: Valuta is a simple and fast conversion tool, ideal for those who need to convert between different currencies repeatedly. Use it while traveling, budgeting, or anytime else you need to quickly convert between two currencies.
ta: வலுடா ஒரு எளிய மற்றும் வேகமான மாற்று கருவியாகும், இது வெவ்வேறு நாணயங்களுக்கு இடையில் மீண்டும் மீண்டும் மாற்ற வேண்டியவர்களுக்கு ஏற்றது. பயணம், பட்செட் அல்லது வேறு எந்த நேரத்திலும் நீங்கள் இரண்டு நாணயங்களுக்கு இடையில் விரைவாக மாற்ற வேண்டும்.

source: Search
ta: தேடல்

source: Search Currencies
ta: நாணயங்களைத் தேடுங்கள்

# shortcuts window
source: General
ta: பொது

# shortcuts window
source: Keyboard shortcuts
ta: விசைப்பலகை குறுக்குவழிகள்

# shortcuts window
source: Switch currencies
ta: நாணயங்களை மாற்றவும்

# shortcuts window
source: Quit
ta: வெளியேறு

source: Error converting, please try again.
ta: மாற்றுவதில் பிழை, தயவுசெய்து மீண்டும் முயற்சிக்கவும்.

source: From
ta: இருந்து

source: Switch
ta: ஆளி, நிலைமாறி

source: To
ta: பெறுநர்

source: Reload
ta: ஏற்றவும்

source: According to
ta: படி

source: Copy
ta: நகலெடு

source: Copy convertion to clipboard
ta: இடைநிலைப்பலகைக்கு மாற்றத்தை நகலெடுக்கவும்

source: Afghan Afghani
ta: ஆப்கானிய ஆப்கானிச்தான்

source: Albanian Lek
ta: அல்பேனிய லெக்

source: Algerian Dinar
ta: அல்சீரிய தினார்

source: Angolan Kwanza
ta: அங்கோலன் ரான்சம்

source: Argentine Peso
ta: அர்சென்டினா பெசோ

source: Armenian Dram
ta: ஆர்மீனிய டிராம்

source: Aruban Florin
ta: அருபன் ஃப்ளோரின்

source: Australian Dollar
ta: ஆச்திரேலிய டாலர்

source: Azerbaijani Manat
ta: அசர்பைசான் மனாட்

source: Bahamian Dollar
ta: பஉாமியன் டாலர்

source: Bahraini Dinar
ta: பஉரைன் தினார்

source: Bajan dollar
ta: டாலர் கீழே வாருங்கள்

source: Bangladeshi Taka
ta: பங்களாதேசி

source: Belarusian Ruble
ta: பெலாரூசியன் ரூபிள்

source: Belize Dollar
ta: பெலிச் டாலர்

source: Bermudan Dollar
ta: பெர்முடன் டாலர்

source: Bhutan currency
ta: பூட்டான் நாணயம்

source: Bitcoin
ta: பிட்காயின்

source: Bitcoin Cash
ta: பிட்காயின் முழுத்தொகை

source: Bolivian Boliviano
ta: பொலிவியன் பொலிவியானோ

source: Bosnia-Herzegovina Convertible Mark
ta: போச்னியா-எர்சகோவினா மாற்றத்தக்க குறி

source: Botswanan Pula
ta: போட்ச்வானா மழை

source: Brazilian Real
ta: பிரேசிலிய உண்மையான

source: Brunei Dollar
ta: புருனே டாலர்

source: Bulgarian Lev
ta: பல்கேரிய லெவ்

source: Burundian Franc
ta: புருண்டியன் ஃபிராங்க்

source: CFP Franc
ta: சி.எஃப்.பி ஃபிராங்க்

source: Cambodian riel
ta: கம்போடியன் ரியல்

source: Canadian Dollar
ta: கனடிய டாலர்

source: Cape Verdean Escudo
ta: கேப் கிரீன் சீல்ட்

source: Cayman Islands Dollar
ta: கேமன் தீவுகள் டாலர்

source: Central African CFA franc
ta: நடு ஆப்பிரிக்க சி.எஃப்.ஏ ஃபிராங்க்

source: Chilean Peso
ta: சிலி பெசோ

source: Chilean Unit of Account (UF)
ta: சிலி பிரிவு (யுஎஃப்)

source: Chinese Yuan
ta: சீன யுவான்

source: Chinese Yuan (offshore)
ta: சீன யுவான் (கடல்)

source: Colombian Peso
ta: கொலம்பிய பெசோ

source: Comorian franc
ta: கொமோரியன் ஃபிராங்க்

source: Congolese Franc
ta: காங்கோ ஃபிராங்க்

source: Costa Rican Colón
ta: கோச்டாரிகன் கோலன்

source: Croatian Kuna
ta: அங்கு குரோசியன்

source: Cuban Peso
ta: கியூபன் பெசோ

source: Czech Koruna
ta: செக் கொருனா

source: Danish Krone
ta: டேனிச் க்ரோன்

source: Djiboutian Franc
ta: சிபூட்டியன் ஃபிராங்க்

source: Dominican Peso
ta: டொமினிகன் பெசோ

source: East Caribbean Dollar
ta: கிழக்கு கரீபியன் டாலர்

source: Egyptian Pound
ta: எகிப்திய பவுண்ட்

source: Ether
ta: அமுதியம்

source: Ethiopian Birr
ta: எத்தியோப்பியன் பிர்ர்

source: Euro
ta: யூரோ

source: Fijian Dollar
ta: டாலரை அமைக்கவும்

source: Gambian dalasi
ta: காம்பியன் தலேச்

source: Georgian Lari
ta: சார்சியன் ரன்கள்

source: Ghanaian Cedi
ta: கானா செடி

source: Gibraltar Pound
ta: சிப்ரால்டர் பவுண்ட்

source: Guatemalan Quetzal
ta: இளம் குவாத்தமாலன்

source: Guinean Franc
ta: கினியன் ஃபிராங்க்

source: Guyanaese Dollar
ta: கயனீச் டாலர்

source: Haitian Gourde
ta: ஐட்டிய சுரைக்காய்

source: Honduran Lempira
ta: ஓண்டுரான் லெம்பிரா

source: Hong Kong Dollar
ta: ஆங்காங் டாலர்

source: Hungarian Forint
ta: அங்கேரியன்

source: Icelandic Króna
ta: ஐச்லாந்திய கிரானா

source: Indian Rupee
ta: இந்திய ரூபாய்

source: Indonesian Rupiah
ta: இந்தோனேசிய ரூபியா

source: Iranian Rial
ta: ஈரானிய ரியால்

source: Iraqi Dinar
ta: ஈராக் தினார்

source: Israeli New Shekel
ta: இச்ரேலிய புதிய செகல்

source: Jamaican Dollar
ta: சமைக்கா டாலர்

source: Japanese Yen
ta: சப்பானிய யென்

source: Jordanian Dinar
ta: சோர்டானிய தினார்

source: Kazakhstani Tenge
ta: குத்தகைதாரரை எவ்வாறு வைத்திருப்பது

source: Kenyan Shilling
ta: கென்ய சில்லிங்

source: Kuwaiti Dinar
ta: குவைத் தினார்

source: Kyrgyzstani Som
ta: கிர்கிச்தானி நான்

source: Laotian Kip
ta: லாவோடியன் கிப்

source: Lebanese pound
ta: லெபனான் பவுண்டு

source: Lesotho loti
ta: லெசோதோ லோடி

source: Liberian Dollar
ta: லைபீரியன் டாலர்

source: Libyan Dinar
ta: லிபிய தினார்

source: Litecoin
ta: லிட்காயின்

source: Macanese Pataca
ta: அகாகனீச் படாக்கா

source: Macedonian Denar
ta: மாசிடோனிய டெனார்

source: Malagasy Ariary
ta: மலகாசி அரியரி

source: Malawian Kwacha
ta: சலன்

source: Malaysian Ringgit
ta: மலேசிய ரிங்கிட்

source: Maldivian Rufiyaa
ta: மால்டிவியன் ரூஃபியா

source: Mauritanian Ouguiya (1973–2017)
ta: மவுரித்தானிய ஓகுயா (1973–2017)

source: Mauritian Rupee
ta: மொரீசிய ரூபாய்

source: Mexican Peso
ta: மெக்சிகன் பெசோ

source: Moldovan Leu
ta: மால்டோவன் லியு

source: Moroccan Dirham
ta: மொராக்கோ திர்உாம்

source: Mozambican metical
ta: மொசாம்பிகன் மெட்டிகல்

source: Myanmar Kyat
ta: மியான்மர் கியாட்

source: New Taiwan dollar
ta: புதிய தைவான் டாலர்

source: Namibian dollar
ta: நமீபியன் டாலர்

source: Nepalese Rupee
ta: நேபாள ரூபாய்

source: Netherlands Antillean Guilder
ta: நெதர்லாந்து ஆன்டிலியன் கில்டர்

source: New Zealand Dollar
ta: நியூசிலாந்து டாலர்

source: Nicaraguan Córdoba
ta: நிகரகுவான் கோர்டோபா

source: Nigerian Naira
ta: நைசீரிய நைரா

source: Norwegian Krone
ta: நோர்வே க்ரோன்

source: Omani Rial
ta: ஓமானி ரியல்

source: Pakistani Rupee
ta: என் பேக் தொடங்குகிறது

source: Panamanian Balboa
ta: பனமேனிய பால்போவா

source: Papua New Guinean Kina
ta: பப்புவா நியூ கினியன் கினா

source: Paraguayan Guarani
ta: பராகுவேய குரணி

source: Philippine Piso
ta: பிலிப்பைன்ச் பிசோ

source: Poland złoty
ta: போலந்து கோல்டன்

source: Pound sterling
ta: பவுண்ட் ச்டெர்லிங்

source: Qatari Rial
ta: கட்டாரி ரியல்

source: Romanian Leu
ta: ருமேனிய லியு

source: Russian Ruble
ta: ரச்ய ரூபிள்

source: Rwandan franc
ta: ருவாண்டன் ஃபிராங்க்

source: Salvadoran Colón
ta: சால்வடோர் கோலன்

source: Saudi Riyal
ta: சவுதி ரியால்

source: Serbian Dinar
ta: செர்பிய தினார்

source: Seychellois Rupee
ta: சீசெல்லோயிச் விரைகிறார்

source: Sierra Leonean Leone
ta: சியரா லியோனியன் லியோன்

source: Singapore Dollar
ta: சிங்கப்பூர் டாலர்

source: Sol
ta: நீர்மக்கூழ்

source: Solomon Islands Dollar
ta: சாலமன் தீவுகள் டாலர்

source: Somali Shilling
ta: சோமாலிய சில்லிங்

source: South African Rand
ta: தென்னாப்பிரிக்க ரேண்ட்

source: South Korean won
ta: தென் கொரியன் வென்றார்

source: Sovereign Bolivar
ta: இறையாண்மை பொலிவார்

source: Special Drawing Rights
ta: சிறப்பு வரைதல் உரிமைகள்

source: Sri Lankan Rupee
ta: இலங்கை தொடங்குகிறது

source: Sudanese pound
ta: சூடான் பவுண்டு

source: Surinamese Dollar
ta: சுரினாமி டாலர்

source: Swazi Lilangeni
ta: ச்லாவாசி வெயிலில் இருக்கிறார்

source: Swedish Krona
ta: ச்வீடிச் க்ரோனா

source: Swiss Franc
ta: சுவிச் ஃபிராங்க்

source: Tajikistani Somoni
ta: தாசிசிகா தாசோனி

source: Tanzanian Shilling
ta: தான்சானிய சில்லிங்

source: Thai Baht
ta: தாய் பாட்

source: Tongan Paʻanga
ta: டோங்கன் கட்டணம்

source: Trinidad & Tobago Dollar
ta: டிரினிடாட் & டொபாகோ டாலர்

source: Tunisian Dinar
ta: துனிசிய தினார்

source: Turkish lira
ta: துருக்கிய லிரா

source: Turkmenistan manat
ta: துர்க்மெனிச்தான் மனாட்

source: Ugandan Shilling
ta: உகாண்டா சில்லிங்

source: Ukrainian hryvnia
ta: உக்ரேனிய இரிவ்னியா

source: United Arab Emirates Dirham
ta: ஐக்கிய அரபு எமிரேட்ச் திர்ஆம்

source: United States Dollar
ta: ஒன்றுபட்டது ச்டேட்ச் டாலர்

source: Uruguayan Peso
ta: உருகுவேய எடை

source: Uzbekistani Som
ta: உச்பெகிச்தான் நான்

source: Vietnamese dong
ta: வியட்நாமிய டோங்

source: West African CFA franc
ta: மேற்கு ஆப்பிரிக்க சி.எஃப்.ஏ ஃபிராங்க்

source: Yemeni Rial
ta: யேமனி ரியல்

source: Zambian Kwacha
ta: சாம்பியன் குவாச்சா

source: Unable to convert currency, failed to fetch results from Google.
ta: நாணயத்தை மாற்ற முடியாமல், கூகிளின் முடிவுகளைப் பெறத் தவறிவிட்டது.

source: Main menu
ta: பட்டியல் விளையாடுங்கள்

source: Source
ta: மூலம்

source: Providers
ta: வழங்குநர்கள்

source: ECB
ta: ஈ.சி.பி.

source: Google (unstable)
ta: கூகிள் (நிலையற்றது)

source: Keyboard shortcuts
ta: விசைப்பலகை குறுக்குவழிகள்

source: About Valuta
ta: வலுடா பற்றி
